In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [7]:
daily_prices = pd.read_parquet("sp500_daily_prices.parquet")

In [9]:
daily_prices.head(2)

           date  close symbol
2544 2010-01-04  31.30      A
2545 2010-01-05  30.96      A

In [10]:
apple = daily_prices.loc[daily_prices.symbol == "AAPL"]

In [12]:
apple.tail(2)

            date   close symbol
83068 2023-08-04  181.99   AAPL
83069 2023-08-07  179.32   AAPL

In [13]:
stocks = ( daily_prices
          .loc[daily_prices.symbol.isin(["AAPL", "IBM", "BA", "NVDA"])] 
          .pivot(index="date", columns="symbol", values="close")
         )

In [14]:
stocks

symbol          AAPL      BA     IBM      NVDA
date
2010-01-04    7.6432   56.18  132.45    4.6225
2010-01-05    7.6564   58.02  130.85    4.6900
2010-01-06    7.5346   59.78  130.00    4.7200
2010-01-07    7.5207   62.20  129.55    4.6275
2010-01-08    7.5707   61.60  130.85    4.6375
...              ...     ...     ...       ...
2023-08-01  195.6050  238.01  143.33  465.0700
2023-08-02  192.5800  231.38  144.17  442.6900
2023-08-03  191.1700  231.36  144.45  445.1500
2023-08-04  181.9900  231.36  144.24  446.8000
2023-08-07  179.3200  236.56  145.91  453.5800

[3421 rows x 4 columns]

### 1) Line Plots